import {ActivityLevel} from "../App";


export const getActivityRecommendation = (fa: ActivityLevel, degree: string) => {
    const d = parseInt(degree)

    if (fa === ActivityLevel.LOW) return "Комплексы специальных дыхательных упражнений, физическая активность с постепенным возрастанием физической нагрузки до среднего уровня в течение одного занятия, циклическая аэробная тренировка в виде дозированной ходьбы, пеших прогулок на короткие расстояния малой интенсивности с постепенным увеличением расстояния (не скорости передвижения!) в сочетании с регламентацией дыхания (свободный вдох ч/з нос и более протяжный выдох ч/з рот)."
    if (fa === ActivityLevel.MIDDLE && d < 50) return "Дыхательная гимнастика, циклическая тренировка (дозированная ходьба. скандинавская ходьба, плавание)."
    if (fa === ActivityLevel.MIDDLE && d > 50) return "Дыхательная гимнастика, циклическая тренировка, воздержание и противопоказание от форсирования физической активности, в отдаленном периоде езда на велосипеде, плавание. Ограничение силовых тренировок."
    if (fa === ActivityLevel.HIGH && d < 50) return "Дыхательная гимнастика, циклическая тренировка (дозированная ходьба, скандинавская ходьба, плавание)."

    return "Дыхательная гимнастика, циклическая тренировка (с постепенным введением более интенсивных видов – плавания, езды на велосипеде, ближнего туризма), воздержание и противопоказание от форсирования физической активности. Ограничение силовых тренировок. "
}