export enum IMT {
    PRONOUNCED_DEFICIENCY,
    UNDERWEIGHT,
    NORMAL,
    OVERWEIGHT,
    OBESITY_FIRST,
    OBESITY_SECOND,
    OBESITY_THIRD
}

const imtRecommendations = {
    [IMT.PRONOUNCED_DEFICIENCY]: "Нормализация пищевого рациона за счет белковой составляющей (мясо, рыба, молочные продукты), жиров. 2.Физическая активность в виде циклических тренировок (терренкур и пешие прогулки), силовые аэробные упражнения средней интенсивности  (ЧСС не выше 50% от ЧСС покоя)",
    [IMT.UNDERWEIGHT]: "Нормализация пищевого рациона за счет белковой составляющей (мясо, рыба, молочные продукты), жиров. 2.Физическая активность в виде циклических тренировок (терренкур и пешие прогулки), силовые аэробные упражнения средней интенсивности  (ЧСС не выше 50% от ЧСС покоя)",
    [IMT.NORMAL]: "Сохранение рациона питания на прежнем уровне. Сохранение физической активности на имеющемся уровне (аэробные силовые, координационные упражнения, циклическая кардиотренировка – интенсивная ходьба, скандинавская ходьба, ходьба на лыжах, плавание, езда на велосипеде)",
    [IMT.OVERWEIGHT]: "Нормализация состава пищевого рациона, за счет уменьшения содержания легко усваиваемых углеводов (сахар, хлеб, мучные и кондитерские изделия, сладкие газированные напитки). Повышение физической активности  за счет аэробных силовых упражнений, интенсивности циклической аэробной «кардиотренировки» – интенсивная ходьба, скандинавская ходьба с увеличенной длиной палок, плавание, езда на велосипеде)",
    [IMT.OBESITY_FIRST]: "Консультация врача-эндокринолога, диетолога. Нормализация состава пищевого рациона, ограничение потребления поваренной соли. Выбор физической активности оказывающей щадящее действие на суставы нижних конечностей и позвоночника: комплексы аэробных физических упражнений высокой интенсивности в исходных положениях лежа на спине, боку, сидя. Циклическая аэробная тренировка (оздоровительное плавание, аквааэробика), скандинавская ходьба,  велосипедные прогулки. Следует исключить силовые изометрические упражнения с элементами натуживания (поднятие гири, штанги, подтягивания), прыжки, бег.",
    [IMT.OBESITY_SECOND]: "Консультация врача-эндокринолога, диетолога. Нормализация состава пищевого рациона, ограничение потребления поваренной соли. Выбор физической активности оказывающей щадящее действие на суставы нижних конечностей и позвоночника: комплексы аэробных физических упражнений высокой интенсивности в исходных положениях лежа на спине, боку, сидя. Циклическая аэробная тренировка (оздоровительное плавание, аквааэробика), скандинавская ходьба,  велосипедные прогулки. Следует исключить силовые изометрические упражнения с элементами натуживания (поднятие гири, штанги, подтягивания), прыжки, бег.",
    [IMT.OBESITY_THIRD]: "Консультация врача-эндокринолога, диетолога. Нормализация состава пищевого рациона, ограничение потребления поваренной соли. Выбор физической активности оказывающей щадящее действие на суставы нижних конечностей и позвоночника: комплексы аэробных физических упражнений высокой интенсивности в исходных положениях лежа на спине, боку, сидя. Циклическая аэробная тренировка (оздоровительное плавание, аквааэробика), скандинавская ходьба,  велосипедные прогулки. Следует исключить силовые изометрические упражнения с элементами натуживания (поднятие гири, штанги, подтягивания), прыжки, бег.",
}

const calculateIMT = (h: string, w: string): IMT => {
    const imt = Math.round(parseFloat(w) / ((parseFloat(h) / 100) * (parseFloat(h) /100)))

    console.log(imt)

    if (imt > 40) return IMT.OBESITY_THIRD
    if ((imt >= 35) && (imt <= 40)) return IMT.OBESITY_SECOND
    if ((imt >= 30) && (imt <= 35)) return IMT.OBESITY_FIRST
    if ((imt >= 25) && (imt <= 30)) return IMT.OVERWEIGHT
    if ((imt >= 18.5) && (imt <= 25)) return IMT.NORMAL
    if ((imt >= 16) && (imt <= 18.5)) return IMT.UNDERWEIGHT

    return IMT.PRONOUNCED_DEFICIENCY
}

export const getIMTRecommendations = (h: string, w: string): string => {
    const imt = calculateIMT(h, w)
    return imtRecommendations[imt]
}